app/controllers/discussions_controller.rb

SELECT * FROM "discussions"
---
  def index
    @discussions = Discussion.all

SELECT * FROM "discussions" WHERE ("discussions"."id" = 1)
---
  def show
    @discussion = Discussion.find(params[:id])