app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-12-27 12:37:50', '122e9aec20b5a2c6d93e06d1a048c2a36b28fc68c431d64d407df838e1168f07b7b1c7fe7cf81eea204cbf0916681fb5154b6ce10a5b3a80d1b6d37e18408445', '2009-12-27 12:37:50', 'jakedahn', 'M_ke4SRoy9-uU1XdHLSJ', '5804b52491b6e4a504d139f55875b1e59aaeeb6a644d996f13f560e3ca8cee28c4495e6d919944e2978184abeb0b726c59c8dd03b8320a078e6149c01719dd19', 'jake@ang.st')
---
  def create
    @user = User.new(params[:user])
    if @user.save